In [4]:
import pandas as pd

In [5]:
from sklearn.datasets import fetch_openml

In [6]:
df = fetch_openml('titanic' , version =1 , as_frame=True)['data']

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 13 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   name       1309 non-null   object
 2   sex        1309 non-null   category
 3   age        1046 non-null   float64
 4   sibsp      1309 non-null   int64
 5   parch      1309 non-null   int64
 6   ticket     1309 non-null   object
 7   fare       1308 non-null   float64
 8   cabin      295 non-null    object
 9   embarked   1307 non-null   category
 10  boat       486 non-null    object
 11  body       121 non-null    float64
 12  home.dest  745 non-null    object
dtypes: category(2), float64(3), int64(3), object(5)
memory usage: 115.4+ KB

In [35]:
df

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,"Allen, Miss. Elisabeth Walton",female,29.000000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,"Allison, Master. Hudson Trevor",male,0.916700,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,"Allison, Miss. Helen Loraine",female,2.000000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.000000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.000000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.500000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,"Zabour, Miss. Thamine",female,29.881135,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,"Zakarian, Mr. Mapriededer",male,26.500000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,"Zakarian, Mr. Ortin",male,27.000000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,"Zimmerman, Mr. Leo",male,29.000000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [18]:
df.isnull().sum()

pclass          0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [44]:
df.cabin

0                B5
1           C22 C26
2           C22 C26
3           C22 C26
4           C22 C26
           ...
1304    C23 C25 C27
1305    C23 C25 C27
1306    C23 C25 C27
1307    C23 C25 C27
1308    C23 C25 C27
Name: cabin, Length: 1309, dtype: object

In [37]:
#filling the empty values using the sklearn using the impute
from sklearn.impute import SimpleImputer
print(f"Number of Null values before imputing: {df.cabin.isnull().sum()} ")

Number of Null values before imputing: 1014

In [47]:
#for the number you can any like the mean . median and most_frequent 
     # imp = SimpleImputer(strategy='mean')
#but for the alphbets you cannot use the mean or meadila but use the most_frequent
imp = SimpleImputer(strategy='most_frequent')
df['cabin'] = imp.fit_transform(df[['cabin']]).ravel()
print(f"The Number of null values in age after colun imputing : {df.cabin.isnull().sum()}")

The Number of null values in age after colun imputing : 0

In [45]:
df

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,"Allen, Miss. Elisabeth Walton",female,29.000000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,"Allison, Master. Hudson Trevor",male,0.916700,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,"Allison, Miss. Helen Loraine",female,2.000000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.000000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.000000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,"Zabour, Miss. Hileni",female,14.500000,1,0,2665,14.4542,C23 C25 C27,C,NaN,328.0,NaN
1305,3,"Zabour, Miss. Thamine",female,29.881135,1,0,2665,14.4542,C23 C25 C27,C,NaN,NaN,NaN
1306,3,"Zakarian, Mr. Mapriededer",male,26.500000,0,0,2656,7.2250,C23 C25 C27,C,NaN,304.0,NaN
1307,3,"Zakarian, Mr. Ortin",male,27.000000,0,0,2670,7.2250,C23 C25 C27,C,NaN,NaN,NaN
1308,3,"Zimmerman, Mr. Leo",male,29.000000,0,0,315082,7.8750,C23 C25 C27,S,NaN,NaN,NaN

In [58]:
#Enconding Data in the machine learning for the  convert to the numbers which was not numericals
from sklearn.preprocessing import OneHotEncoder
df[['female', 'male']] = OneHotEncoder().fit_transform(df[['sex']]).toarray()
df[['sex','female', 'male']]

      sex  female  male
0     0.0     1.0   0.0
1     1.0     0.0   1.0
2     0.0     1.0   0.0
3     1.0     0.0   1.0
4     0.0     1.0   0.0
...   ...     ...   ...
1304  0.0     1.0   0.0
1305  0.0     1.0   0.0
1306  1.0     0.0   1.0
1307  1.0     0.0   1.0
1308  1.0     0.0   1.0

[1309 rows x 3 columns]

In [57]:
df['sex'] = OneHotEncoder().fit_transform(df[['sex']]).toarray()[:,1]

In [8]:
df.head()

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [12]:
#working with the data scaling  for adjust the range between the numbers 
from sklearn.preprocessing import StandardScaler

In [9]:
num_cols = df.select_dtypes(include=['int64' , 'float64' , 'int32']).columns
print(num_cols)

Index(['pclass', 'age', 'sibsp', 'parch', 'fare', 'body'], dtype='object')

In [16]:
ss = StandardScaler()

In [19]:
df[num_cols] =ss.fit_transform(df[num_cols])
df[num_cols].describe()

,pclass,age,sibsp,parch,fare,body
count,1.309000e+03,1.046000e+03,1.309000e+03,1.309000e+03,1308.000000,1.210000e+02
mean,-1.737003e-16,-2.717181e-17,1.085627e-17,1.628440e-17,0.000000,-2.202095e-17
std,1.000382e+00,1.000478e+00,1.000382e+00,1.000382e+00,1.000382,1.004158e+00
min,-1.546098e+00,-2.062556e+00,-4.790868e-01,-4.449995e-01,-0.643529,-1.642574e+00
25%,-3.520907e-01,-6.164626e-01,-4.790868e-01,-4.449995e-01,-0.490921,-9.128147e-01
50%,8.419164e-01,-1.305744e-01,-4.790868e-01,-4.449995e-01,-0.364161,-5.971606e-02
75%,8.419164e-01,6.329641e-01,4.812878e-01,-4.449995e-01,-0.039051,9.783920e-01
max,8.419164e-01,3.478880e+00,7.203909e+00,9.956864e+00,9.258680,1.718429e+00